# Pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 1

In [2]:
np.nan

nan

### 2

In [3]:
1 + np.nan

nan

### 3

In [4]:
type(np.nan)

float

### 4

In [6]:
s1 = Series(['Yueshun Yuan', 'Kai Luo', np.nan, np.nan], index=['16205134', '16206133', '16205132', '16205135'])
s1

16205134    Yueshun Yuan
16206133         Kai Luo
16205132             NaN
16205135             NaN
dtype: object

In [7]:
s1.isnull()

16205134    False
16206133    False
16205132     True
16205135     True
dtype: bool

In [9]:
s1.notnull()

16205134     True
16206133     True
16205132    False
16205135    False
dtype: bool

### 5

In [10]:
s1

16205134    Yueshun Yuan
16206133         Kai Luo
16205132             NaN
16205135             NaN
dtype: object

In [11]:
s2 = s1.dropna()
s2

16205134    Yueshun Yuan
16206133         Kai Luo
dtype: object

### 6

In [15]:
df1 = DataFrame({'Team': {'D.Green': 'LAL', 'S.Curry': 'GSW', 'J.Yuan': np.nan, 'J.Lin': np.nan}, 
                'Position': {'D.Green': 'SG', 'S.Curry': 'PG', 'J.Yuan': np.nan, 'J.Lin': 'PG'}, 
                'Number': {'D.Green': '14', 'S.Curry': '30', 'J.Yuan': np.nan, 'J.Lin': np.nan}})
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [16]:
df1.isnull()

          Team  Position  Number
D.Green  False     False   False
S.Curry  False     False   False
J.Yuan    True      True    True
J.Lin     True     False    True

In [17]:
df1.notnull()

          Team  Position  Number
D.Green   True      True    True
S.Curry   True      True    True
J.Yuan   False     False   False
J.Lin    False      True   False

### 7

In [18]:
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [19]:
df2 = df1.dropna(axis=0)
df2

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30

### 8

In [20]:
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [21]:
df3 = df1.dropna(axis=1)
df3

Empty DataFrame
Columns: []
Index: [D.Green, S.Curry, J.Yuan, J.Lin]

### 9

In [22]:
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [23]:
df4 = df1.dropna(axis=0, how='any')
df4

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30

### 10

In [24]:
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [25]:
# 只有行中全部是 NaN 的时候才会将该行删掉

df5 = df1.dropna(axis=0, how='all')
df5

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Lin    NaN       PG    NaN

### 11

In [26]:
df1

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    NaN       PG    NaN

In [30]:
df6 = df1.fillna(value={'Team': 'CBA'})
df6

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   CBA      NaN    NaN
J.Lin    CBA       PG    NaN

In [32]:
df7 = df1.fillna(value={'Team': {'J.Lin': 'CBA'}, 'Number': {'J.Lin': '7'}})
df7

        Team Position Number
D.Green  LAL       SG     14
S.Curry  GSW       PG     30
J.Yuan   NaN      NaN    NaN
J.Lin    CBA       PG      7